CSI API ETABS v1
cPropAreaSpring.SetAreaSpringProp Method
 Creates a new named area spring property, or modifies an existing named area spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetAreaSpringProp(
	string Name,
	double U1,
	double U2,
	double U3,
	int NonlinearOption3,
	int SpringOption = 1,
	string SoilProfile = "",
	double EndLengthRatio = 0,
	double Period = 0,
	int color = 0,
	string notes = "",
	string iGUID = ""
)
Function SetAreaSpringProp (
	Name As String,
	U1 As Double,
	U2 As Double,
	U3 As Double,
	NonlinearOption3 As Integer,
	Optional SpringOption As Integer = 1,
	Optional SoilProfile As String = "",
	Optional EndLengthRatio As Double = 0,
	Optional Period As Double = 0,
	Optional color As Integer = 0,
	Optional notes As String = "",
	Optional iGUID As String = ""
) As Integer
Dim instance As cPropAreaSpring
Dim Name As String
Dim U1 As Double
Dim U2 As Double
Dim U3 As Double
Dim NonlinearOption3 As Integer
Dim SpringOption As Integer
Dim SoilProfile As String
Dim EndLengthRatio As Double
Dim Period As Double
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.SetAreaSpringProp(Name,
	U1, U2, U3, NonlinearOption3, SpringOption,
	SoilProfile, EndLengthRatio, Period,
	color, notes, iGUID)
int SetAreaSpringProp(
	String^ Name,
	double U1,
	double U2,
	double U3,
	int NonlinearOption3,
	int SpringOption = 1,
	String^ SoilProfile = L"",
	double EndLengthRatio = 0,
	double Period = 0,
	int color = 0,
	String^ notes = L"",
	String^ iGUID = L""
)
abstract SetAreaSpringProp :
        Name : string *
        U1 : float *
        U2 : float *
        U3 : float *
        NonlinearOption3 : int *
        ?SpringOption : int *
        ?SoilProfile : string *
        ?EndLengthRatio : float *
        ?Period : float *
        ?color : int *
        ?notes : string *
        ?iGUID : string
(* Defaults:
        let _SpringOption = defaultArg SpringOption 1
        let _SoilProfile = defaultArg SoilProfile ""
        let _EndLengthRatio = defaultArg EndLengthRatio 0
        let _Period = defaultArg Period 0
        let _color = defaultArg color 0
        let _notes = defaultArg notes ""
        let _iGUID = defaultArg iGUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of the area spring property. If this is an existing property, that property is modified; otherwise, a new property is added.
U1
Type: System.Double
 The spring stiffness per unit area in the local 1 direction [F/L3]
U2
Type: System.Double
 The spring stiffness per unit area in the local 2 direction [F/L3]
U3
Type: System.Double
 The spring stiffness per unit area in the local 3 direction [F/L3]
NonlinearOption3
Type: System.Int32
 The nonlinear option for the local 3 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
SpringOption (Optional)
Type: System.Int32
 This optional argument is for a future release
SoilProfile (Optional)
Type: System.String
 This optional argument is for a future release
EndLengthRatio (Optional)
Type: System.Double
 This optional argument is for a future release
Period (Optional)
Type: System.Double
 This optional argument is for a future release
color (Optional)
Type: System.Int32
 The display color for the property specified as an integer
notes (Optional)
Type: System.String
 The notes, if any, assigned to the property
iGUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
   ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   ret = SapModel.PropAreaSpring.SetAreaSpringProp("mySpringProp1", 0, 0, 100, 0)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropAreaSpring Interface
ETABSv1 Namespace